#### Terraform Initialization :gear:`success`
#### Terraform Plan :book:`success`

<details><summary>Show Plan Output</summary>

```

Acquiring state lock. This may take a few moments...
data.azurerm_resource_group.rg: Reading...
data.azurerm_resource_group.rg: Read complete after 0s [id=/subscriptions/[subscription-id]/resourceGroups/DEMO-gh-actions-fed-auth]
azurerm_storage_account.storage: Refreshing state... [id=/subscriptions/[subscription-id]/resourceGroups/DEMO-gh-actions-fed-auth/providers/Microsoft.Storage/storageAccounts/storcr1ghactions2]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_private_dns_zone.storage_dns will be created
  + resource "azurerm_private_dns_zone" "storage_dns" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.blob.core.windows.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "DEMO-gh-actions-fed-auth"

      + soa_record (known after apply)
    }

  # azurerm_private_dns_zone_virtual_network_link.storage_dns_link will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "storage_dns_link" {
      + id                    = (known after apply)
      + name                  = "storcr1ghactions2-dns-link"
      + private_dns_zone_name = "privatelink.blob.core.windows.net"
      + registration_enabled  = false
      + resource_group_name   = "DEMO-gh-actions-fed-auth"
      + virtual_network_id    = (known after apply)
    }

  # azurerm_private_endpoint.storage_endpoint will be created
  + resource "azurerm_private_endpoint" "storage_endpoint" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "westus3"
      + name                     = "storcr1ghactions2-endpoint"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "DEMO-gh-actions-fed-auth"
      + subnet_id                = (known after apply)

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "storage-dns-zone-group"
          + private_dns_zone_ids = (known after apply)
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "storcr1ghactions2-privateserviceconnection"
          + private_connection_resource_id = "/subscriptions/[subscription-id]/resourceGroups/DEMO-gh-actions-fed-auth/providers/Microsoft.Storage/storageAccounts/storcr1ghactions2"
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "blob",
            ]
        }
    }

  # azurerm_storage_account.storage will be updated in-place
  ~ resource "azurerm_storage_account" "storage" {
        id                                = "/subscriptions/[subscription-id]/resourceGroups/DEMO-gh-actions-fed-auth/providers/Microsoft.Storage/storageAccounts/storcr1ghactions2"
        name                              = "storcr1ghactions2"
      ~ public_network_access_enabled     = true -> false
        tags                              = {}
        # (62 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # azurerm_subnet.subnet will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                               = [
          + "10.0.1.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "storcr1ghactions2-subnet"
      + private_endpoint_network_policies_enabled      = true
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "DEMO-gh-actions-fed-auth"
      + virtual_network_name                           = "storcr1ghactions2-vnet"
    }

  # azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "westus3"
      + name                = "storcr1ghactions2-vnet"
      + resource_group_name = "DEMO-gh-actions-fed-auth"
      + subnet              = (known after apply)
    }

Plan: 5 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: main.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "main.tfplan"
Releasing state lock. This may take a few moments...

```


</details>
